{
	"title" : "Welcome to Theatre!",
	"content" : "<section><p>Please be sure to read the <a href='https://gitlab.com/Ayanzo/theatre/wikis/home/Introduction-to-Theatre'>instructions</a> on gitlab for how to get started, as well as the <a href='https://gitlab.com/Ayanzo/theatre/wikis/reference/Control-Reference'>control schema</a>!</p><p><b>A new update is available (v1.0.3) which adds several minor fixes. If you already have version 1.0.3, disreard this message.</b></p></section><section><h1>Discontinuation of Support Notice</h1><p>Theatre is officially in 'End of Life' support as I have elected to leave FVTT due to actions done by the developer of the platform. What this means is that future updates will simply be compatibility updates if the piping changes, but no new features will be added. Also these support updates will not be released in a timely matter, or in sync with FVTT's updates. If an update breaks theatre functionality, it may be weeks before I patch it. (v1.0.3) will be the last version to receive new features.</p></section>",
	"unotes": "<section><h2>Update Notes for <b>(v1.0.3)</b></h2><ul style='font-size: 15px;'><li style='margin-top: 10px'><b>Narrator text content has added padding</b> to prevent it from hitting the edges of the screen.</li><li style='margin-top: 10px'><b>Narrator bar now has options for screen height placement</b> allowing the GM to decide the height of the screen to place it at.</li><li style='margin-top: 10px'><b>Application of 'default' settings has been changed.</b> Default settings are now only set when no insert is actively speaking. Prior to this, whenever you changed emotes or text modes for narrator or as a speaking insert, it would configure the default to those settings as well. It no longer does this now.</li><li style='margin-top: 10px'><b>Clear Box Style</b> : A new theatre bar display mode has been added to accomodate for voice only games where displaying the insert graphic takes priority over seeing any output text clearly. Text <u>will be difficut to read</u> in this mode, as it's inteded for emoting, and nudging only.</li><li style='margin-top: 10px'><b>New 'move insert to' control</b> : This new control for text-boxes allows users to move inserts to take the position of another insert. It's similar to swap except it only will 'squeeze in' the moved insert to the new position rather than swapping with the target. <u>Note that this overrides the binding for swap</u> in that right mouse click drag will trigger a move operation. <u>The old swap operation requires holding shift on <i>release</i> of the right mouse drag operation.</u></li><li style='font-size: 15px;'><b>Bug Fix:</b> Bubble bounce height is now uniform (unless the name text is smaller due to compression)</li><li><b>Bug Fix:</b> Theatre suppression no longer changes the alpha level of the emote preview box.</li></ul></section><section><h1>Discontinuation of Support Notice</h1><p>Theatre is officially in 'End of Life' support as I have elected to leave FVTT due to actions done by the developer of the platform. What this means is that future updates will simply be compatibility updates if the piping changes, but no new features will be added. Also these support updates will not be released in a timely matter, or in sync with FVTT's updates. If an update breaks theatre functionality, it may be weeks before I patch it. (v1.0.3) will be the last version to receive new features.</p></section>",
	"newinfo" : 2,
	"version" : "1.0.3"
}
